<template>
  <div id="contentBox">
    <h1>START.</h1>
    <p>
      초등학교 4학년, 방과후 수업을 통해 컴퓨터를 처음 접하게 되었습니다. 타이핑 연습, 프로그램의 사용법,
      검색 엔진 사용 등을 익혔습니다. 배우고, 탐구하는 것이 좋아 독서가 취미였던 어린 아이에게 검색어만 입력
      하면 여러 가지 정보를 제공하는 컴퓨터는 큰 도서관이었습니다. <span class="bold">`이 큰 도서관은 누가, 어떻게 만들었을까?`.</span>
      이 질문은 유저에서 개발자로 다가가는 첫 걸음이었습니다.

    </p>
    <p>
      도서관을 설계하고, 만들고, 디자인하는 직업.
      프로그래머라는 직업이 매력적이었습니다. 프로그래밍을 더 구체적으로 배워보고 싶어 IT 영재교육원에서
      C언어 기초 교육을 받았고, 서울시 IT 산출물대회에서 은상을 수상하는 등 프로그래머의 꿈과 실력을 키워
      나갔습니다. 프로그래머로 더 성장하고 싶은 마음에 IT 특성화 고등학교인 선린 인터넷 고등학교에 진학했고, 여러 대회 경험과 실무 경험을 쌓으면서
      Python, JavaScript같은 프로그래밍 언어부터 자료구조, 알고리즘에 이르기까지 프로그래밍에 대해
      폭넓게 공부했습니다.
    </p>
    <h1>함께, 또 같이.</h1>
    <p>
      선린 인터넷 고등학교는 IT 특성화 고등학교답게 여러 활동을 할 수 있었습니다. 기초적인 언어에 대한 교육
      은 물론, 학습한 것을 토대로 여러 교내 대회를 개최했고 외부 대회에 참가할 기회도 잦았습니다. 또한, 학생들이 주도하는 동아리 시스템이 잘 구축되어 있었습니다.
      저는 누구나 쉽게 접근할 수 있는 지구상에서 가장
      큰 도서관인 웹에 매력을 느껴 웹 동아리인 `IWOP`에 들어갔습니다. `IWOP`에선 웹의 역사와 HTTP와 같은 프로토콜, HTML, CSS,
      JavaScript에 대해 배우고 자기 소개 페이지, 정보 소개 페이지와 같은 기초적인 페이지를 만들었습니다.
      동아리에선 팀 프로젝트를 경험할 수 있었는데, 혼자 모든 프로젝트를 진행하는 것보다
      여러 사람이 힘을 합쳐 협업하는 것이 결과물도 좋으면서, 시간 역시 경제적으로 사용할 수 있다는 것을 배웠습니다.
    </p>
    <p>
      저는 어렸을 때부터 함께하는 것을 좋아했습니다. 혼자보다, 같은 목표를 가진 사람들이 만나 시너지 효과를
      내며 함께하는 ‘팀’을 추구하게 되었습니다. 선린인터넷고등학교에 입학한 후 마음이 맞는 친구들과 대회에
      참가하는 것이 학교생활의 낙이었습니다. 팀과 손발을 맞춰 대회를 준비하면서 창업을 해 보자는 이야기가
      나왔고, 그 이야기는 상상하던 것을 실현하겠다는 의미의 ‘Realize’라는 회사가 되었습니다. 친구들 사이에서
      성실한 일꾼으로 뽑혔던 전 CEO의 역할을 맡아 회사를 이끄는 귀중한 경험을 할 수 있었습니다.
      처음 맞닥뜨린 벽은 바로 의견 대립, 시간 조정 등의 소통 문제였습니다. 그로 인해 양보하며 고민을 해결하는
      방법을 찾고 모든 구성원들의 의견을 반영하는 과정을 반복하게 되었고, 그 결과 의견을 절충하는 방법과
      문제 해결과정을 누구보다 값진 경험으로 배울 수 있었습니다.
    </p>
    <p>
      두 번째로 만난 벽은 바로 제 능력이었습니다. ‘CEO’라는 자리에게 요구되는 거래명세서, 업무일지와 같은
      문서들은 부담감으로 다가왔습니다. 제가 친구들에 비해 전문능력이 부족해 팀에 걸림돌이 되고 있다는 생각에
      책임의식을 가지고 회계부터 lean, Agile, scrum, kanban과 같은 방법론까지 폭 넓은 분야를 공부하면서 팀적으로 더 도움을 줄 수 있었습니다.
      "타인과 함께, 타인을 통해서 협력할 때에야 비로소 위대한 것이 탄생한다."는 생텍쥐페리의 명언을 다시 새기며
      팀 구성원들과 함께 더 큰 공동체 안에서 함께 하고 싶습니다.
    </p>
  </div>
</template>
<script>
  export default{

  }
</script>
<style scope>
h1{
  margin:0px;
  font-weight:700;
}
#contentBox{
  padding:2%;
}
a{
  text-decoration: none;
}
p{
  line-height: 30px;
  font-size:18px;
}
.bold{
  font-weight: 700;
}
</style>
