<template>
  <div id="contentBox">
    <h1>작은 것 하나</h1>
    <p>
      작은 배려 하나 하나가 모여 큰 감동을 준다고 합니다. 제 가치관은 ‘내 능력을 통해 사회에 기여하자’입니다.
      평소 삶의 가치를 '더불어 사는 것'에 두고 있습니다. 제가 할 수 있는 작은 것에서부터 시작하고 싶어, 제 행동에 사회기여적인 측면을 많이 고려합니다.
    </p>
    <p>
      실천사례 첫 번째. 자살예방센터 홍보 웹진의 퍼블리싱을 맡았습니다. 대한민국의 자살률은 OECD 가입 국가 중 1위로,
      매우 높습니다. 전국 각 지역엔 자살예방센터들이 존재하고 있지만 존재 여부조차 모르는 사람들이 여전히
      많습니다. 'IWOP' 웹 동아리를 통해 성북구 자살예방센터의 홍보 웹진을 제작하는 봉사를 진행해 많은 사람들에게 자살예방센터를 알렸습니다. <br />
      실천사례 두 번째. 아동센터에서 가정 형편이 좋지 않은 아이들을 가르쳤습니다. 방화동에 위치한 밝은지역아동센터에서는 아이들에게 다양한 분야의 교육을 실시해
      특기적성을 개발해 주는데, 그 중 컴퓨터 교육을 맡아 PPT, 한글과 같은 프로그램 사용법과 올바른 인터넷의 사용 방법,
       컴퓨터의 역사, 자료 검색, 타이핑, 스크래치 등을 가르쳤습니다. 제 봉사를 통해 아이들이 컴퓨터가 쉬워졌다며
      기뻐하고, 프로그래머의 꿈을 꾸는 것을 보고 뿌듯했습니다. <br />
      실천사례 세 번째. 컴퓨터를 어렸을 때부터 접해서인지 타이핑이 빠른 편입니다. 이를 활용해 시각장애인을 위한 전자 도서를 제작했습니다.
      책을 지정 받아 타이핑한 후 전용 프로그램을 통해 소리 파일로 변환하면 책을 들을 수 있게 됩니다.
    </p>
    <p>
      창업 이후에도 제 가치관을 토대로 여러 프로젝트를 기획했습니다. 'Dream Scrapper'는 각 분야의 전문가들이 각자 블로그를 운영하며 여러 가지 팁이나 강좌를 올리면, 그에
      관심있는 유저들이 검색을 통해 꿈과 관련된 정보를 얻을 수 있는 어플리케이션입니다. 꼭 직업이나 공부에 국한되지 않고 음악,
      요리 등 여러 분야에 걸쳐 꿈을 가진 사람들이 전문가 1:1 상담이나 위키 형식의 정보 전달로 그 꿈에 대한 정보를 더 쉽게 얻을 수 있게
      하고, 교육까지 받을 수 있는 환경을 제공하는 어플리케이션이었습니다. 또한, 요즘의 부족한 역사 인식에 문제를 느껴 `소셜벤쳐경진대회`에서
      직접 역사 속 인물이 되어 여러 가지 선택지를 거치며 역사를 자연스럽게 배울 수 있게 하는 교육용 게임인 `History Adventure`를 기획했습니다.
    </p>
    <h1>기획과 개발 사이</h1>
    <p>
      `Realize`에서의 경험들, 각종 프로젝트의 경험들은 대부분 기획자, 웹 퍼블리셔로서의 경험이었습니다.
      무언가를 새롭게 창조하고, 설계하고, 소통을 통해 매끄럽게 프로젝트가 진행되는
      과정을 지휘하는 것이 흥미로웠습니다. 하지만, 기술 없이는 한계가 있다는 생각이 들었습니다. 자그마한 버그조차
      개발자에게 얘기해야 했고, 사소한 디자인 수정도 디자이너에게 맡겨야 했습니다. 이는 개발프로세스에 지연을 가져왔고,
      직접 여러 가지 프로그램을 공부하게 되는 계기가 되었습니다. 더 많은 것을 배우고 싶어 대학에 진학하게 되었고,
      HTML과 CSS, JavaScript를 전문서적과 인터넷 매체를 통해 공부했습니다. 최근 프론트엔드 개발자로서의 프로젝트를 진행하다 보니
      Webpack이나 express, git, react, vue.js, eslint와 같은 여러 프레임워크나 라이브러리,
      패키지들을 접하게 되면서 여러 프로그램들을 직접 써보고 익혀야겠다는 생각에 여러 개인 프로젝트에 적용해보고 있습니다.
      여러 프로젝트 경험을 통해 소통에 익숙하고 이해력이 좋아 새로운 것을 쉽게 습득하며, 더 많은 것을 알고자 하는
      열의가 있습니다. 학생의 자세로 더 많은 것을 배우고 익혀 도서관에 기여하는 창조자 중 하나로 거듭나고 싶습니다.
    </p>
  </div>
</template>
<script>
  export default{

  }
</script>
<style scope>
h1{
  margin:0px;
  font-weight:700;
}
#contentBox{
  padding:2%;
}
a{
  text-decoration: none;
}
p{
  line-height: 30px;
  font-size:18px;
}
.bold{
  font-weight: 700;
}
</style>
